app/controllers/students_controller.rb

  def update
    @student = Student.find(params[:id])
    @student.update(student_params(:last_name))
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2018-05-23 16:04:45.843392"], ["id", 1]]